Revit 2024 API
PathReinforcement.IsUnobscuredInView Method
 Checks if Path Reinforcement is shown unobscured in a view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsUnobscuredInView(
	View view
)
Visual Basic
Public Function IsUnobscuredInView ( _
	view As View _
) As Boolean
Visual C++
public:
bool IsUnobscuredInView(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view element
Return Value
 True if Path Reinforcement is shown unobscured, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This element doesn't have valid visibility data.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace